In [10]:
import sqlite3
import pandas as pd

## Reading data from a relational database

In [2]:
connection = sqlite3.connect('../data/ClassicModels.db')

In [3]:
cursor = connection.cursor()

In [5]:
query = "SELECT * FROM Employees WHERE officeCode = 1"

In [6]:
results = cursor.execute(query)

In [8]:
data = results.fetchall()

In [9]:
data

[(1002,
  'Murphy',
  'Diane',
  'x5800',
  'dmurphy@classicmodelcars.com',
  0,
  'President',
  '1'),
 (1056,
  'Patterson',
  'Mary',
  'x4611',
  'mpatterso@classicmodelcars.com',
  1002,
  'VP Sales',
  '1'),
 (1076,
  'Firrelli',
  'Jeff',
  'x9273',
  'jfirrelli@classicmodelcars.com',
  1002,
  'VP Marketing',
  '1'),
 (1143,
  'Bow',
  'Anthony',
  'x5428',
  'abow@classicmodelcars.com',
  1056,
  'Sales Manager (NA)',
  '1'),
 (1165,
  'Jennings',
  'Leslie',
  'x3291',
  'ljennings@classicmodelcars.com',
  1143,
  'Sales Rep',
  '1'),
 (1166,
  'Thompson',
  'Leslie',
  'x4065',
  'lthompson@classicmodelcars.com',
  1143,
  'Sales Rep',
  '1')]

In [13]:
columns = [r[0] for r in results.description]

In [14]:
pd.DataFrame(data, columns=columns)

,employeeNumber,lastName,firstName,extension,email,reportsTo,jobTitle,officeCode
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,0,President,1
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1002,VP Sales,1
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1002,VP Marketing,1
3,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1056,Sales Manager (NA),1
4,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1143,Sales Rep,1
5,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1143,Sales Rep,1

In [12]:
results.description

(('employeeNumber', None, None, None, None, None, None),
 ('lastName', None, None, None, None, None, None),
 ('firstName', None, None, None, None, None, None),
 ('extension', None, None, None, None, None, None),
 ('email', None, None, None, None, None, None),
 ('reportsTo', None, None, None, None, None, None),
 ('jobTitle', None, None, None, None, None, None),
 ('officeCode', None, None, None, None, None, None))

# Using Pandas

In [16]:
df = pd.read_sql_query(query, connection, index_col='employeeNumber')

In [17]:
df.head()

,lastName,firstName,extension,email,reportsTo,jobTitle,officeCode
employeeNumber,,,,,,,
1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,0,President,1
1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1002,VP Sales,1
1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1002,VP Marketing,1
1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1056,Sales Manager (NA),1
1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1143,Sales Rep,1

## Exercise

Write an SQL Query to report total payments for the customer below

In [1]:
customer = "Atelier graphique"